# PA Bond

## Inserir dados da tabela do BD

## Connect to database

In [1]:
import sqlite3 
import sqlalchemy as sa
from sqlalchemy import create_engine
import pandas as pd

In [2]:
## 1 - Criar a conexao do bd
db=create_engine('sqlite:///dataset///db_olist.sqlite',echo=False)
conn=db.connect()

## Loading Datasets

In [3]:
## 2- listar todos os bd importados 
#!ls

In [9]:
## 3- ler a bd com pandas
df_costumer = pd.read_csv('dataset/olist_customers_dataset.csv')

In [10]:
## 3- ler a bd com pandas
df_order_id = pd.read_csv('dataset/olist_order_items_dataset.csv')

In [11]:
df_order_id.head()

,order_id,order_item_id,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

### customer

In [7]:

## 4- criar um esquema com o nome das colunas e o tipo de dados (TEXT, INTERGER, REAL)
schema_customer = """

CREATE TABLE customer(
    customer_id                 TEXT,
    customer_unique_id          TEST,
    customer_zip_code_prefix    INTERGER,
    customer_city               TEXT,
    customer_state              TEXT
    )
    """

## 5- executar o schema
conn.execute(schema_customer)


## 6- insert data into table (append lista apos ou replace lista substituindo)
df_costumer.to_sql('customer', con=conn, if_exists='append', index=False)

OperationalError: (sqlite3.OperationalError) table customer already exists
[SQL:

CREATE TABLE customer(
    customer_id                 TEXT,
    customer_unique_id          TEST,
    customer_zip_code_prefix    INTERGER,
    customer_city               TEXT,
    customer_state              TEXT
    )
    ]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### geolocation

In [28]:
df_geolocation = pd.read_csv('dataset/olist_geolocation_dataset.csv')


schema_geolocation = """

CREATE TABLE geolocation(

    geolocation_zip_code_prefix    INTERGER,
    geolocation_lat                REAL,
    geolocation_lng                REAL,
    geolocation_city               TEXT,
    geolocation_state              TEXT


)
"""

## create schema
#conn.execute(schema_geolocation)


## insert data into table 
df_geolocation.to_sql('geolocation', con=conn, if_exists='append', index=False)

1000163

### order_items

In [29]:
df_order_items = pd.read_csv('dataset/olist_order_items_dataset.csv')


schema_order_items = """

CREATE TABLE order_items(

    order_id                TEXT,
    order_item_id           INTERGER,
    product_id              TEXT,
    seller_id               TEXT,
    shipping_limit_date     TEXT,
    price                   REAL,
    freight_value           REAL

)

"""

## create schema
#conn.execute(schema_order_items)


## insert data into table 
df_order_items.to_sql('order_items', con=conn, if_exists='append', index=False)

112650

### order_payments

In [30]:
df_order_payments = pd.read_csv('dataset/olist_order_payments_dataset.csv')


schema_order_payments = """

CREATE TABLE order_payments(

    order_id                  TEXT,
    payment_sequential        INTERGER,
    payment_type              TEXT,
    payment_installments      INTERGER,
    payment_value             REAL

)

"""

## create schema
#conn.execute(schema_order_payments)


## insert data into table 
df_order_payments.to_sql('order_payments', con=conn, if_exists='append', index=False)

103886

### order_reviews

In [31]:
df_order_reviews = pd.read_csv('dataset/olist_order_reviews_dataset.csv')


schema_order_reviews = """

CREATE TABLE order_reviews(

    review_id                  TEXT,
    order_id                   TEXT,
    review_score               INTERGER,
    review_comment_title       TEXT,
    review_comment_message     TEXT,
    review_creation_date       TEXT,
    review_answer_timestamp    TEXT

)

"""

## create schema
#conn.execute(schema_order_reviews)


## insert data into table 
df_order_reviews.to_sql('order_reviews', con=conn, if_exists='replace', index=False)

99224

### orders

In [32]:
df_orders = pd.read_csv('dataset/olist_orders_dataset.csv')


schema_orders= """

CREATE TABLE orders(

    order_id                         TEXT,
    customer_id                      TEXT,
    order_status                     TEXT,
    order_purchase_timestamp         TEXT,
    order_approved_at                TEXT,
    order_delivered_carrier_date     TEXT,
    order_delivered_customer_date    TEXT,
    order_estimated_delivery_date    TEXT

)

"""

## create schema
#conn.execute(schema_orders)


## insert data into table 
df_orders.to_sql('orders', con=conn, if_exists='replace', index=False)

99441

### products

In [33]:
df_products = pd.read_csv('dataset/olist_products_dataset.csv')


schema_products= """

CREATE TABLE products(

    product_id                     TEXT,
    product_category_name          TEXT,
    product_name_lenght           REAL,
    product_description_lenght    REAL,
    product_photos_qty            REAL,
    product_weight_g              REAL,
    product_length_cm             REAL,
    product_height_cm             REAL,
    product_width_cm              REAL
)

"""

## create schema
#conn.execute(schema_products)


## insert data into table 
df_products.to_sql('products', con=conn, if_exists='replace', index=False)

32951

### sellers

In [13]:
df_sellers = pd.read_csv('Datasets/olist_sellers_dataset.csv')


schema_sellers= """

CREATE TABLE sellers(

    seller_id                 TEXT,
    seller_zip_code_prefix    INTERGER,
    seller_city               TEXT,
    seller_state              TEXT
)

"""

## create schema
#conn.execute(schema_sellers)


## insert data into table 
df_sellers.to_sql('sellers', con=conn, if_exists='replace', index=False)

### category_name_translation

In [34]:
df_category_name_translation = pd.read_csv('dataset/product_category_name_translation.csv')


schema_category_name_translation= """

CREATE TABLE category_name_translation(

    product_category_name            TEXT,
    product_category_name_english    TEXT
)

"""

## create schema
#conn.execute(schema_category_name_translation)


## insert data into table 
df_category_name_translation.to_sql('category_name_translation', con=conn, if_exists='replace', index=False)

71

## Check table

In [55]:
#8 - Ver o tipo de dados pra copiar no esquema
df_category_name_translation.dtypes

NameError: name 'df_category_name_translation' is not defined

In [15]:
## ver se a tabela foi criada 

query="""
SELECT name
FROM sqlite_master
WHERE type ='table'
"""

table=pd.read_sql_query(query,conn)
table

                        name
0                   customer
1                geolocation
2                order_items
3             order_payments
4      product_category_name
5                    sellers
6              order_reviews
7                     orders
8                   products
9  category_name_translation

# Exercicios PA Bond - aula 2

## 1 Gere uma tabela com o id do cliente, a cidade e o estado onde ele vive.

In [7]:
## ver se a tabela foi criada 

query="""
SELECT
c.customer_id ,
c.customer_city ,
c.customer_state
FROM customer c
LIMIT 100;

"""
table=pd.read_sql_query(query,conn)
table

                         customer_id          customer_city customer_state
0   06b8999e2fba1a1fbc88172c00ba8bc7                 franca             SP
1   18955e83d337fd6b2def6b18a428ac77  sao bernardo do campo             SP
2   4e7b3e00288586ebd08712fdd0374a03              sao paulo             SP
3   b2b6027bc5c5109e529d4dc6358b12c3        mogi das cruzes             SP
4   4f2d8ab171c80ec8364f7c12e35b23ad               campinas             SP
..                               ...                    ...            ...
95  f89c1a6b9c966869e441e55bc14acddc             sao carlos             SP
96  23e96758fd640560e9b1fbcda90abfc4              sao paulo             SP
97  369708cabd9831ea6fde670a3b602a92              sao paulo             SP
98  5f8b4882b5a4ec7bf6d2107e6cd0cf29                niteroi             RJ
99  ad6891a1937cb8723a2c08ba1ae59873               sao luis             MA

[100 rows x 3 columns]

## 2. Gere uma tabela com o id do cliente e a cidade, somente dos clientes que vivem em Santa Catarina.

In [8]:
query="""
SELECT
c.customer_id ,
c.customer_city ,
c.customer_state
FROM customer c
WHERE c.customer_state = 'SC'
LIMIT 100;

"""
table=pd.read_sql_query(query,conn)
table

                         customer_id   customer_city customer_state
0   879864dab9bc3047522c92c82e1212b8  jaragua do sul             SC
1   154c4ded6991bdfa3cd249d11abf4130   florianopolis             SC
2   b6368ca0f56d4632f44d58ca431487b2        sao jose             SC
3   4d27341acd30a36bca39008ee9bb9050  jaragua do sul             SC
4   443b534d0d27a8aa9a184d4869bcbe7a  jaragua do sul             SC
..                               ...             ...            ...
95  32e23352f904da0c1128c0e9cf4ee89e  guaruja do sul             SC
96  03a2a04722a38803d8c29c7339998d54        sao jose             SC
97  44e28727116b6aaf62a51b276aba9247        blumenau             SC
98  da513f66aecb0c97a487d422bf105af0         tubarao             SC
99  80cd284463cd296129eab19cac5f012f         videira             SC

[100 rows x 3 columns]

## 3. Gere uma tabela com o id do cliente e o estado, somente dos clientes que vivem em Florianópolis.

In [9]:
query="""
SELECT
c.customer_id ,
c.customer_city ,
c.customer_state
FROM customer c
WHERE c.customer_city = 'florianopolis'
LIMIT 100;

"""
table=pd.read_sql_query(query,conn)
table

                         customer_id  customer_city customer_state
0   154c4ded6991bdfa3cd249d11abf4130  florianopolis             SC
1   2173c184771a8a19f6fc87d8b3dea9e0  florianopolis             SC
2   02f615f19af07c54a0d4653308f6674b  florianopolis             SC
3   151260cb5d9b3c220d0af50c81c329a9  florianopolis             SC
4   d494b02fb3835e2d398d44ea7f275bce  florianopolis             SC
..                               ...            ...            ...
95  8395381b2c2766ebceb43c768072fbce  florianopolis             SC
96  280b6e60c0323ca7dea55d10501f5291  florianopolis             SC
97  5c1547bae5d0f335ad4b7728b54be141  florianopolis             SC
98  12a371f2183b5d71d81830f3dd3b32c8  florianopolis             SC
99  0fb80a7fe135dc3abd1469007f5b9ac7  florianopolis             SC

[100 rows x 3 columns]

## 4. Gere uma tabela com o estado, latitude e longitude do estado de São Paulo

In [10]:
query="""
SELECT
g.geolocation_lat,               
g.geolocation_lng,
geolocation_state
FROM geolocation g
WHERE geolocation_state = 'SP'
LIMIT 100;

"""
table=pd.read_sql_query(query,conn)
table

    geolocation_lat  geolocation_lng geolocation_state
0        -23.545621       -46.639292                SP
1        -23.546081       -46.644820                SP
2        -23.546129       -46.642951                SP
3        -23.544392       -46.639499                SP
4        -23.541578       -46.641607                SP
..              ...              ...               ...
95       -23.546129       -46.642951                SP
96       -23.544667       -46.640669                SP
97       -23.546341       -46.636239                SP
98       -23.549107       -46.644105                SP
99       -23.549292       -46.633559                SP

[100 rows x 3 columns]

## 5. Gere uma tabela com o id do produto, a data de envio e o preço, somente para produtos acima de 6300

In [11]:
query="""
SELECT
oi.product_id,
oi.price,
oi.shipping_limit_date
FROM order_items oi
WHERE oi.price>6300
LIMIT 100;

"""
table=pd.read_sql_query(query,conn)
table

                         product_id   price  shipping_limit_date
0  489ae2aa008f021502940f251d4cce7f  6735.0  2017-02-16 20:37:36
1  1bdf5e6731585cf01aa8169c7028d6ad  6499.0  2017-06-15 02:45:17
2  69c590f7ffc7bf8db97190b6cb6ed62e  6729.0  2018-08-02 04:05:13
3  489ae2aa008f021502940f251d4cce7f  6735.0  2017-02-16 20:37:36
4  1bdf5e6731585cf01aa8169c7028d6ad  6499.0  2017-06-15 02:45:17
5  69c590f7ffc7bf8db97190b6cb6ed62e  6729.0  2018-08-02 04:05:13
6  489ae2aa008f021502940f251d4cce7f  6735.0  2017-02-16 20:37:36
7  1bdf5e6731585cf01aa8169c7028d6ad  6499.0  2017-06-15 02:45:17
8  69c590f7ffc7bf8db97190b6cb6ed62e  6729.0  2018-08-02 04:05:13

## 6. Gere uma tabela com o id do pedido, o tipo de pagamento e o número de parcelas, somente para produtos com parcelas menores que 1.

In [19]:
query="""
SELECT
op.order_id ,
op.payment_type ,
op.payment_installments
FROM order_payments op
WHERE op.payment_installments < 1

"""
table=pd.read_sql_query(query,conn)
table

                           order_id payment_type  payment_installments
0  744bade1fcf9ff3f31d860ace076d422  credit_card                     0
1  1a57108394169c0b47d8f876acc9ba2d  credit_card                     0
2  744bade1fcf9ff3f31d860ace076d422  credit_card                     0
3  1a57108394169c0b47d8f876acc9ba2d  credit_card                     0
4  744bade1fcf9ff3f31d860ace076d422  credit_card                     0
5  1a57108394169c0b47d8f876acc9ba2d  credit_card                     0
6  744bade1fcf9ff3f31d860ace076d422  credit_card                     0
7  1a57108394169c0b47d8f876acc9ba2d  credit_card                     0

## 7. Gere uma tabela com o id do pedido, id do cliente, o status do pedido e a data de aprovação , somente para compras aprovadas até dia 05 de Maio de 2016

In [23]:
query="""
SELECT
o.order_id ,
o.customer_id ,
o.order_status ,
o.order_approved_at
FROM orders o
WHERE o.order_approved_at < '2016-10-05'

"""
table=pd.read_sql_query(query,conn)
table

,order_id,customer_id,order_status,order_approved_at
0,7033745709b7cf1bac7d2533663592de,7f0ca17bb33b230b47459437cf0682c7,delivered,2016-10-04 14:46:48
1,cd3b8574c82b42fc8129f6d502690c3e,7812fcebfc5e8065d31e1bb5f0017dae,delivered,2016-10-04 10:19:23
2,c4b41c36dd589e901f6879f25a74ec1d,4bb880cac21c7a9e1371ab1ebd601706,delivered,2016-10-04 13:26:11
3,711b9be9c346d9ecdb9d38a5e1e7e39b,81e4aed5ab4253757305267b80712689,invoiced,2016-10-04 14:08:38
4,3f72d2b757e725cd48a4726f831c7789,e0de521fbb397bd7e83d079fe66357b5,delivered,2016-10-04 13:47:04
5,bfbd0f9bdef84302105ad712db648a6c,86dc2ffce2dfff336de2f386a786e574,delivered,2016-09-15 12:16:38
6,79ffdd52a918bbe867895a4b183d6457,f9808148a262b51d20e2d777eee6676c,delivered,2016-10-04 12:25:20
7,ef1b29b591d31d57c0d7337460dd83c9,dc607dc98d6a11d5d04d9f2a70aa6c34,delivered,2016-10-04 10:28:19
8,c3d9e402b6a0fbe2a5f7fc5b41117c38,5720a15d022c09d2634c71c80c8d4102,delivered,2016-10-04 10:45:33
9,36989eb07a0de2d3d3129eea35553875,aadd27185177fc7ac9b364898ac09343,delivered,2016-10-04 13:46:31
10,ae8a60e4b03c5a4ba9ca0672c164b181,e6f959bf384d1d53b6d68826699bba12,delivered,2016-10-04 10:28:25
11,1ff217aa612f6cd7c4255c9bfe931c8b,b3a9bf200375f53cc5c6991919c356fd,delivered,2016-10-04 09:43:32
12,22613579f7d11cc59c4347526fc3c79e,53cc5d344077104b59d4f6836a90eb0b,delivered,2016-10-04 14:27:49
13,ed8c7b1b3eb256c70ce0c74231e1da88,da0ba2a9935bca5b4610b0e3bca9d3b4,delivered,2016-10-04 10:25:46
14,46046adea0e222a29259bad3d922fee8,e9722ab28655e07763e0ca2751c61c90,delivered,2016-10-04 11:06:07
15,1aecadf4362edaca7fa033e882076c8d,e81a9f176936e3124dfd90c483bf3289,canceled,2016-10-04 10:26:40
16,4d66b3a9d12facad48a3b23cc9fe7898,bd6048a0960b15881f1ae5dca277fb52,delivered,2016-10-04 14:09:08
17,f3f12fc90564a9b036680a887cd64668,3c521eac04e2dca4702dcc69789618c2,delivered,2016-10-04 13:47:06
18,d207cc272675637bfed0062edffd0818,b8cf418e97ae795672d326288dfab7a7,delivered,2016-10-04 10:28:07
19,65d1e226dfaeb8cdc42f665422522d14,70fc57eeae292675927697fe03ad3ff5,canceled,2016-10-04 10:18:57
20,63638a6806d67773f3adba8534553fff,16e14c1e6e050fe6730c961ff638ca23,delivered,2016-10-04 13:47:45

# Exercicios PA Bond - aula 3

## 1. Qual o número de clientes únicos do estado de Minas Gerais?

In [27]:
query="""
SELECT
COUNT( DISTINCT customer_id )
FROM customer c
WHERE customer_state = 'MG'

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT customer_id )
0                          11635

In [28]:
query="""
SELECT
COUNT( customer_id )
FROM customer c
WHERE customer_state = 'MG'

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( customer_id )
0                 46540

## 2. Qual a quantidade de cidades únicas dos vendedores do estado de Santa Catarina?

In [31]:
query="""
SELECT
COUNT( DISTINCT seller_city )
FROM sellers s
WHERE s.seller_state = 'SC'

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT seller_city )
0                             65

## 3.Qual a quantidade de cidades únicas de todos os vendedores da base?

In [33]:
query="""
SELECT
COUNT( DISTINCT seller_city )
FROM sellers s

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT seller_city )
0                            611

## 4. Qual o número total de pedidos únicos acima de R$ 3.500

In [34]:
query="""
SELECT
COUNT( DISTINCT order_id )
FROM order_items oi
WHERE price > 3500

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT order_id )
0                          18

## 5. Qual o valor médio do preço de todos os pedidos?

In [8]:
query="""

SELECT
AVG( price )
FROM order_items oi

"""
table=pd.read_sql_query(query,conn)
table

   AVG( price )
0    120.653739

## 6. Qual o maior valor de preço entre todos os pedidos?

In [12]:
query="""

SELECT
MAX( price ) as Max_price
FROM order_items oi

"""
table=pd.read_sql_query(query,conn)
table

   Max_price
0     6735.0

## 7. Qual o menor valor de preço entre todos os pedidos?

In [13]:
query="""

SELECT
MIN( price ) 
FROM order_items oi

"""
table=pd.read_sql_query(query,conn)
table

   MIN( price )
0          0.85

## 8. Qual a quantidade de produtos distintos vendidos abaixo do preço de R$ 100.00?

In [17]:
query="""

SELECT
COUNT( DISTINCT product_id ) 
FROM order_items oi
WHERE price<100
"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT product_id )
0                         20112

## 9. Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016?

In [22]:
query="""

SELECT
COUNT( DISTINCT seller_id ) 
FROM order_items oi
WHERE shipping_limit_date<'2016-09-23 00:00:00' 
"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT seller_id )
0                            2

## 10. Quais os tipos de pagamentos existentes?

In [31]:
query="""

SELECT
    DISTINCT payment_type  
FROM order_payments op
 
"""
table=pd.read_sql_query(query,conn)
table

  payment_type
0  credit_card
1       boleto
2      voucher
3   debit_card
4  not_defined

## 11. Qual o maior número de parcelas realizado?

In [32]:
query="""

SELECT
MAX( op.payment_installments ) 
FROM order_payments op

"""
table=pd.read_sql_query(query,conn)
table

   MAX( op.payment_installments )
0                              24

## 12. Qual o menor número de parcelas realizado?

In [33]:
query="""

SELECT
MIN( op.payment_installments ) 
FROM order_payments op

"""
table=pd.read_sql_query(query,conn)
table

   MIN( op.payment_installments )
0                               0

## 13. Qual a média do valor pago no cartão de crédito?

In [36]:
query="""

SELECT
AVG( op.payment_value ) 
FROM order_payments op
WHERE op.payment_type ='credit_card'
"""
table=pd.read_sql_query(query,conn)
table

   AVG( op.payment_value )
0               163.319021

## 14. Quantos tipos de status para um pedido existem?

In [42]:
query="""

SELECT
    COUNT(DISTINCT o.order_status)
FROM orders o

"""
table=pd.read_sql_query(query,conn)
table

   COUNT(DISTINCT o.order_status)
0                               8

## 15. Quais os tipos de status para um pedido?

In [68]:
query="""

SELECT
    DISTINCT o.order_status
FROM orders o

"""
table=pd.read_sql_query(query,conn)
table

  order_status
0    delivered
1     invoiced
2      shipped
3   processing
4  unavailable
5     canceled
6      created
7     approved

## 16. Quantos clientes distintos fizeram um pedido?

In [69]:
query="""

SELECT
    COUNT(DISTINCT o.customer_id)
FROM orders o

"""
table=pd.read_sql_query(query,conn)
table

   COUNT(DISTINCT o.customer_id)
0                          99441

## 17. Quantos produtos estão cadastrados na empresa?

In [46]:
query="""

SELECT
    COUNT(DISTINCT p.product_id)
FROM products P

"""
table=pd.read_sql_query(query,conn)
table

   COUNT(DISTINCT p.product_id)
0                         32951

## 18. Qual a quantidade máxima de fotos de um produto?

In [48]:
query="""

SELECT
    MAX (p.product_photos_qty)
FROM products P

"""
table=pd.read_sql_query(query,conn)
table

   MAX (p.product_photos_qty)
0                        20.0

## 19. Qual o maior valor do peso entre todos os produtos?

In [64]:
query="""

SELECT
    MAX (p.product_weight_g)
FROM products P

"""
table=pd.read_sql_query(query,conn)
table

   MAX (p.product_weight_g)
0                   40425.0

## 20. Qual a altura média dos produtos?

In [65]:
query="""

SELECT
    AVG(p.product_height_cm) 
FROM products p

"""
table=pd.read_sql_query(query,conn)
table

   AVG(p.product_height_cm)
0                 16.937661

In [66]:
query="""

SELECT
    AVG(DISTINCT p.product_height_cm) 
FROM products p

"""
table=pd.read_sql_query(query,conn)
table

   AVG(DISTINCT p.product_height_cm)
0                          52.666667

# Exercicios PA Bond - aula 4

## Qual o número de clientes únicos de todos os estados?

In [12]:
# tem um erro no gabarito
query="""

SELECT
c.customer_state,
COUNT( DISTINCT c.customer_id ) AS numero_clientes
FROM customer c
GROUP BY c.customer_state

"""
table=pd.read_sql_query(query,conn)
table

   customer_state  numero_clientes
0              AC               81
1              AL              413
2              AM              148
3              AP               68
4              BA             3380
5              CE             1336
6              DF             2140
7              ES             2033
8              GO             2020
9              MA              747
10             MG            11635
11             MS              715
12             MT              907
13             PA              975
14             PB              536
15             PE             1652
16             PI              495
17             PR             5045
18             RJ            12852
19             RN              485
20             RO              253
21             RR               46
22             RS             5466
23             SC             3637
24             SE              350
25             SP            41746
26             TO              280

## Qual o número de cidades únicas de todos os estados?

In [13]:
query="""

SELECT
customer_state ,
COUNT( DISTINCT customer_city ) AS numero_cidades
FROM customer c
GROUP BY customer_state
"""
table=pd.read_sql_query(query,conn)
table

   customer_state  numero_cidades
0              AC               8
1              AL              68
2              AM               5
3              AP               6
4              BA             353
5              CE             161
6              DF               6
7              ES              95
8              GO             178
9              MA             122
10             MG             745
11             MS              67
12             MT             101
13             PA              89
14             PB              92
15             PE             152
16             PI              72
17             PR             364
18             RJ             149
19             RN              90
20             RO              35
21             RR               2
22             RS             379
23             SC             240
24             SE              46
25             SP             629
26             TO              56

## . Qual o número de clientes únicos por estado e por cidade?

In [18]:
query="""

SELECT
c.customer_state,
c.customer_city,

COUNT( DISTINCT c.customer_id ) AS numero_clientes
FROM customer c
GROUP BY c.customer_state,c.customer_city


"""
table=pd.read_sql_query(query,conn)
table

     customer_state            customer_city  numero_clientes
0                AC                brasileia                1
1                AC          cruzeiro do sul                3
2                AC           epitaciolandia                1
3                AC            manoel urbano                1
4                AC               porto acre                1
...             ...                      ...              ...
4305             TO             silvanopolis                1
4306             TO  sitio novo do tocantins                2
4307             TO               taguatinga                3
4308             TO           tocantinopolis                7
4309             TO                  xambioa                3

[4310 rows x 3 columns]

## Qual o número de clientes únicos por cidade e por estado?

In [17]:
query="""

SELECT
c.customer_city,
c.customer_state,
COUNT( DISTINCT c.customer_id ) AS numero_clientes
FROM customer c
GROUP BY c.customer_city,c.customer_state


"""
table=pd.read_sql_query(query,conn)
table

            customer_city customer_state  numero_clientes
0     abadia dos dourados             MG                3
1               abadiania             GO                1
2                  abaete             MG               12
3              abaetetuba             PA               11
4                 abaiara             CE                2
...                   ...            ...              ...
4305             xinguara             PA                9
4306          xique-xique             BA                3
4307             zacarias             SP                2
4308              ze doca             MA                5
4309               zortea             SC                2

[4310 rows x 3 columns]

## . Qual o número total de pedidos únicos acima de R$ 3.500 por cada vendedor?

In [44]:
query="""

SELECT
    oi.seller_id,
    COUNT( DISTINCT oi.order_id ) AS numero_de_ordens
FROM order_items oi
WHERE oi.price > 3.500
GROUP BY oi.seller_id

"""
table=pd.read_sql_query(query,conn)
table

                             seller_id  numero_de_ordens
0     0015a82c2db000af6aaaf3ae2ecb0532                 3
1     001cca7ae9ae17fb1caed9dfb1094831               200
2     001e6ad469a905060d959994f1b41e4f                 1
3     002100f778ceb8431b7a1020ff7ab48f                51
4     003554e2dce176b5555353e4f3555ac8                 1
...                                ...               ...
3089  ffcfefa19b08742c5d315f2791395ee5                 1
3090  ffdd9f82b9a447f6f8d4b91554cc7dd3                18
3091  ffeee66ac5d5a62fe688b9d26f83f534                14
3092  fffd5413c0700ac820c7069d66d98c89                60
3093  ffff564a4f9085cd26170f4732393726                20

[3094 rows x 2 columns]

 ## Qual o número total de pedidos únicos, a data mínima e máxima de envio, o valor máximo, mínimo e médio do frete dos pedidos acima de R$ 1.100 por cada vendedor?

In [47]:
query="""

SELECT
    oi.seller_id,
    MIN(oi.shipping_limit_date) as data_minima,
    MAX(oi.shipping_limit_date) as data_maxima,
    MIN(oi.freight_value) as frete_minimo,
    MAX(oi.freight_value) as frete_maximo,
    AVG(oi.freight_value) as frete_medio,
    COUNT( DISTINCT oi.order_id ) AS numero_de_ordens
FROM order_items oi
WHERE oi.price > 1100
GROUP BY oi.seller_id

"""
table=pd.read_sql_query(query,conn)
table

,seller_id,data_minima,data_maxima,frete_minimo,frete_maximo,frete_medio,numero_de_ordens
0,014c0679dd340a0e338872e7ec85666a,2018-02-08 13:49:36,2018-02-08 13:49:36,49.63,49.63,49.630000,1
1,02d35243ea2e497335cd0f076b45675d,2017-12-22 12:19:24,2017-12-22 12:19:24,97.32,97.32,97.320000,1
2,0307f7565ff85b299b6e5ef162b1b1a9,2017-03-06 12:05:26,2017-03-06 12:05:26,59.73,59.73,59.730000,1
3,039e6ad9dae79614493083e241147386,2018-04-09 11:49:03,2018-08-06 21:06:10,49.55,104.72,69.684000,5
4,04308b1ee57b6625f47df1d56f00eedf,2017-11-21 02:35:37,2018-07-24 21:50:27,24.55,70.29,39.393077,13
...,...,...,...,...,...,...,...
175,f9244d45189d3a3605499abddeade7d5,2017-04-14 07:54:19,2018-08-13 20:55:31,45.74,83.13,67.740000,3
176,fa1c13f2614d7b5c4749cbc52fecda94,2017-02-04 17:01:46,2018-05-10 16:13:33,15.96,27.75,20.512000,10
177,fbc14c0cf93505ef89f64665ffa4a7b5,2017-10-10 13:28:18,2018-08-08 19:35:19,25.64,70.70,42.885000,4
178,ff063b022a9a0aab91bad2c9088760b7,2018-08-22 16:30:44,2018-08-22 16:30:44,42.67,42.67,42.670000,1
179,ff69aa92bb6b1bf9b8b7a51c2ed9cf8b,2018-01-29 22:53:23,2018-06-14 16:19:31,37.26,254.55,128.230000,6

##  Qual o valor médio, máximo e mínimo do preço de todos os pedidos de cada produto?

In [49]:
query="""

SELECT
    oi.product_id,
    MIN(oi.price) as preco_min,
    MAX(oi.price) as preco_max,
    AVG(oi.price) as preco_medio
FROM order_items oi
GROUP BY oi.product_id

"""
table=pd.read_sql_query(query,conn)
table

                             product_id  preco_min  preco_max  preco_medio
0      00066f42aeeb9f3007548bb9d3f33c38     101.65     101.65       101.65
1      00088930e925c41fd95ebfe695fd2655     129.90     129.90       129.90
2      0009406fd7479715e4bef61dd91f2462     229.00     229.00       229.00
3      000b8f95fcb9e0096488278317764d19      58.90      58.90        58.90
4      000d9be29b5207b54e86aa1b1ac54872     199.00     199.00       199.00
...                                 ...        ...        ...          ...
32946  fff6177642830a9a94a0f2cba5e476d1     109.99     119.99       114.99
32947  fff81cc3158d2725c0655ab9ba0f712c      90.00      90.00        90.00
32948  fff9553ac224cec9d15d49f5a263411f      32.00      32.00        32.00
32949  fffdb2d0ec8d6a61f0a0a0db3f25b441      29.99      34.99        33.99
32950  fffe9eeff12fcbd74a2f2b007dde0c58     249.99     249.99       249.99

[32951 rows x 4 columns]

## Qual a quantidade de vendedores distintos que receberam algum pedido antes do dia 23 de setembro de 2016 e qual foi o preço médio desses pedidos?

In [58]:
query="""

SELECT
    oi.shipping_limit_date,
    COUNT( DISTINCT oi.seller_id ) AS vendedores_distintos,
    AVG (price) as preco_medio

FROM order_items oi
WHERE oi.shipping_limit_date < '2016-09-23'

"""
table=pd.read_sql_query(query,conn)
table

   shipping_limit_date  vendedores_distintos  preco_medio
0  2016-09-19 23:11:33                     2      48.6175

In [59]:
query="""

SELECT
    oi.shipping_limit_date,
    COUNT( DISTINCT oi.seller_id ) AS vendedores_distintos,
    AVG (price) as preco_medio

FROM order_items oi
WHERE oi.shipping_limit_date < '2016-09-23'
GROUP by oi.shipping_limit_date

"""
table=pd.read_sql_query(query,conn)
table

   shipping_limit_date  vendedores_distintos  preco_medio
0  2016-09-19 00:15:34                     1        59.50
1  2016-09-19 23:11:33                     1        44.99

## salta

## Qual a quantidade de pedidos por tipo de pagamentos?

In [62]:
query="""

SELECT
    op.payment_type,
    COUNT( op.order_id ) AS pedidos
FROM order_payments op
GROUP by op.payment_type

"""
table=pd.read_sql_query(query,conn)
table

  payment_type  pedidos
0       boleto    79136
1  credit_card   307180
2   debit_card     6116
3  not_defined       12
4      voucher    23100

## Qual a quantidade de pedidos, a média do valor do pagamento e o número máximo de parcelas por tipo de pagamentos?

In [65]:
query="""

SELECT
    op.payment_type,
    COUNT( op.order_id ) AS qtd_pedidos,
    AVG(op.payment_value) AS media_pagamentos,
    MAX(op.payment_installments) AS max_parcelas
FROM order_payments op
GROUP by op.payment_type

"""
table=pd.read_sql_query(query,conn)
table

  payment_type  qtd_pedidos  media_pagamentos  max_parcelas
0       boleto        79136        145.034435             1
1  credit_card       307180        163.319021            24
2   debit_card         6116        142.570170             1
3  not_defined           12          0.000000             1
4      voucher        23100         65.703354             1

## Qual a valor mínimo, máximo, médio e as soma total paga por cada tipo de pagamento e número de parcelas disponíveis?

In [63]:
CREATE TABLE order_payments(

    order_id                  TEXT,
    payment_sequential        INTERGER,
    payment_type              TEXT,
    payment_installments      INTERGER,
    payment_value             REAL

)

"""

SyntaxError: invalid syntax (4140862015.py, line 1)

In [71]:
query="""

SELECT
    op.payment_type,
    op.payment_installments AS parcelas,
    MIN(op.payment_value) AS min_pagamentos,
    MAX(op.payment_value) AS max_pagamentos,
    AVG(op.payment_value) AS media_pagamentos,
    SUM(op.payment_value) AS soma_pagamentos
FROM order_payments op
GROUP by op.payment_type, payment_installments

"""
table=pd.read_sql_query(query,conn)
table

,payment_type,parcelas,min_pagamentos,max_pagamentos,media_pagamentos,soma_pagamentos
0,boleto,1,11.62,7274.88,145.034435,1.147745e+07
1,credit_card,0,58.69,129.94,94.315000,7.545200e+02
2,credit_card,1,0.01,13664.08,95.872930,9.761782e+06
3,credit_card,2,20.03,2442.82,127.228150,6.317132e+06
4,credit_card,3,30.00,3256.14,142.539317,5.964415e+06
5,credit_card,4,40.00,3126.50,163.976840,4.655630e+06
6,credit_card,5,49.99,4809.44,183.465222,3.844697e+06
7,credit_card,6,59.99,2828.42,209.849952,3.290447e+06
8,credit_card,7,69.97,2094.44,187.673672,1.220630e+06
9,credit_card,8,37.58,6929.31,307.737427,5.253693e+06
10,credit_card,9,90.11,2116.01,203.440870,5.240637e+05
11,credit_card,10,37.67,4950.34,415.085837,8.846309e+06
12,credit_card,11,110.30,198.83,124.932174,1.149376e+04
13,credit_card,12,121.09,1543.25,321.678496,1.711330e+05
14,credit_card,13,130.00,278.00,150.462500,9.629600e+03
15,credit_card,14,139.98,417.45,167.962667,1.007776e+04
16,credit_card,15,151.93,2647.76,445.553108,1.318837e+05
17,credit_card,16,160.12,651.05,292.694000,5.853880e+03
18,credit_card,17,170.00,177.99,174.602500,5.587280e+03
19,credit_card,18,180.76,1232.85,486.483333,5.254020e+04
20,credit_card,20,200.08,2022.33,615.801765,4.187452e+04
21,credit_card,21,212.03,303.02,243.700000,2.924400e+03
22,credit_card,22,228.71,228.71,228.710000,9.148400e+02
23,credit_card,23,236.48,236.48,236.480000,9.459200e+02
24,credit_card,24,241.42,1440.10,610.048889,4.392352e+04
25,debit_card,1,13.38,4445.50,142.570170,8.719592e+05
26,not_defined,1,0.00,0.00,0.000000,0.000000e+00
27,voucher,1,0.00,3184.34,65.703354,1.517747e+06

## salta

## Qual a média de pedidos por cliente?

In [74]:
query="""

SELECT
    o.customer_id,
    AVG(o.order_id) AS media_pedidos
FROM orders o
GROUP BY o.customer_id

"""
table=pd.read_sql_query(query,conn)
table

                            customer_id  media_pedidos
0      00012a2ce6f8dcda20d059ce98491703            5.0
1      000161a058600d5901f007fab4c27140            0.0
2      0001fd6190edaaf884bcaf3d49edf079          316.0
3      0002414f95344307404f0ace7a26f1d5         5825.0
4      000379cdec625522490c315e70c7a9fb            0.0
...                                 ...            ...
99436  fffecc9f79fd8c764f843e9951b11341          814.0
99437  fffeda5b6d849fbd39689bb92087f431            8.0
99438  ffff42319e9b2d713724ae527742af25           83.0
99439  ffffa3172527f765de70084a7e53aae8            0.0
99440  ffffe8b65bbe3087b653a978c870db99            inf

[99441 rows x 2 columns]

## Qual a quantidade de pedidos realizados por cada status do pedido, a partir do dia 23 de Setembro de 2016?

In [77]:
query="""

SELECT
    o.order_status,
    COUNT(o.order_id) AS media_pedidos
FROM orders o
WHERE o.order_approved_at>'2016-09-23'
GROUP BY o.order_status

"""
table=pd.read_sql_query(query,conn)
table

  order_status  media_pedidos
0     approved              2
1     canceled            484
2    delivered          96463
3     invoiced            314
4   processing            301
5      shipped           1107
6  unavailable            609

## Qual a quantidade de pedidos realizados por dia, a partir do dia 23 de Setembro de 2016?

In [ ]:
query="""

SELECT
    o.order_status,
    COUNT(o.order_id) AS media_pedidos
FROM orders o
WHERE o.order_approved_at>'2016-09-23'
GROUP BY o.order_status

"""
table=pd.read_sql_query(query,conn)
table

## Quantos produtos estão cadastrados na empresa por categoria?

In [ ]:
CREATE TABLE products(

    product_id                     TEXT,
    product_category_name          TEXT,
    product_name_lenght           REAL,
    product_description_lenght    REAL,
    product_photos_qty            REAL,
    product_weight_g              REAL,
    product_length_cm             REAL,
    product_height_cm             REAL,
    product_width_cm              REAL
)

In [83]:
query="""

SELECT
    p.product_category_name,
    COUNT( DISTINCT p.product_id) AS qtd_produtos
FROM products p
GROUP BY p.product_category_name
"""
table=pd.read_sql_query(query,conn)
table

        product_category_name  qtd_produtos
0                        None           610
1   agro_industria_e_comercio            74
2                   alimentos            82
3           alimentos_bebidas           104
4                       artes            55
..                        ...           ...
69    sinalizacao_e_seguranca            93
70   tablets_impressao_imagem             9
71                  telefonia          1134
72             telefonia_fixa           116
73      utilidades_domesticas          2335

[74 rows x 2 columns]

# Exercicios PA Bond - aula 5

## 1. Qual o número de clientes únicos do estado de São Paulo?

In [12]:
query="""
SELECT
COUNT( DISTINCT customer_id )
FROM customer c
WHERE customer_state = 'SP'

"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT customer_id )
0                          41746

## Qual o número total de pedidos únicos feitos no dia 08 de Outubro de 2016

In [20]:
query="""
SELECT
COUNT( DISTINCT o.order_id ) numero_pedidos
FROM orders o
WHERE o.order_approved_at ='2016-10-08'

"""
table=pd.read_sql_query(query,conn)
table

   numero_pedidos
0               0

In [21]:
query="""
SELECT
COUNT( DISTINCT order_id )
FROM order_items oi
WHERE DATE( shipping_limit_date ) = '2016-10-08'


"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT order_id )
0                           8

## Qual o número total de pedidos únicos feitos a partir do dia 08 de Outubro de 2016

In [22]:
query="""
SELECT
COUNT( DISTINCT order_id )
FROM order_items oi
WHERE DATE( shipping_limit_date ) > '2016-10-08'


"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT order_id )
0                       98656

## Qual o número total de pedidos únicos feitos a partir do dia 08 de Outubro de 2016 incluso.

In [23]:
query="""
SELECT
COUNT( DISTINCT order_id )
FROM order_items oi
WHERE DATE( shipping_limit_date ) >= '2016-10-08'


"""
table=pd.read_sql_query(query,conn)
table

   COUNT( DISTINCT order_id )
0                       98664

## Qual o número total de pedidos únicos, a data mínima e máxima de envio, o valor máximo, mínimo e médio do frete dos pedidos abaixo de R$ 1.100 por cada vendedor?

In [29]:
query="""

SELECT
    oi.seller_id,
    COUNT( DISTINCT oi.order_id ) AS pedidos_unicos,
    MIN( oi.shipping_limit_date ) AS data_min,
    MAX( oi.shipping_limit_date ) AS data_max,
    MIN( oi.freight_value ) AS valor_frete_min,
    MAX( oi.freight_value ) AS valor_frete_max,
    AVG( oi.freight_value ) AS valor_frete_medio
FROM order_items oi
WHERE oi.price < 1100
GROUP BY oi.seller_id


"""
table=pd.read_sql_query(query,conn)
table

,seller_id,pedidos_unicos,data_min,data_max,valor_frete_min,valor_frete_max,valor_frete_medio
0,0015a82c2db000af6aaaf3ae2ecb0532,3,2017-10-12 22:24:16,2017-10-24 23:56:20,21.02,21.02,21.020000
1,001cca7ae9ae17fb1caed9dfb1094831,200,2017-02-08 19:06:04,2018-07-19 21:50:17,14.72,114.62,37.046611
2,001e6ad469a905060d959994f1b41e4f,1,2018-08-13 23:05:23,2018-08-13 23:05:23,17.94,17.94,17.940000
3,002100f778ceb8431b7a1020ff7ab48f,51,2017-09-20 01:10:15,2018-04-18 13:11:45,4.91,34.15,14.430182
4,003554e2dce176b5555353e4f3555ac8,1,2017-12-21 07:11:03,2017-12-21 07:11:03,19.38,19.38,19.380000
...,...,...,...,...,...,...,...
3051,ffcfefa19b08742c5d315f2791395ee5,1,2018-06-28 17:55:45,2018-06-28 17:55:45,9.62,9.62,9.620000
3052,ffdd9f82b9a447f6f8d4b91554cc7dd3,18,2017-03-09 16:30:20,2018-08-29 12:10:52,12.19,98.87,36.373000
3053,ffeee66ac5d5a62fe688b9d26f83f534,14,2017-10-05 16:14:11,2018-05-22 03:30:31,20.88,77.98,29.977857
3054,fffd5413c0700ac820c7069d66d98c89,60,2017-07-30 21:25:19,2018-08-28 20:10:15,9.94,206.45,46.454754
3055,ffff564a4f9085cd26170f4732393726,20,2016-10-17 19:01:41,2017-04-19 02:45:41,10.96,37.19,17.228000

##  Qual o número total de pedidos únicos, a data mínima e máxima de envio, o valor máximo, mínimo e médio do frete dos pedidos abaixo de R$ 1.100 incluso por cada vendedor?

In [30]:
query="""

SELECT
    oi.seller_id,
    COUNT( DISTINCT oi.order_id ) AS pedidos_unicos,
    MIN( oi.shipping_limit_date ) AS data_min,
    MAX( oi.shipping_limit_date ) AS data_max,
    MIN( oi.freight_value ) AS valor_frete_min,
    MAX( oi.freight_value ) AS valor_frete_max,
    AVG( oi.freight_value ) AS valor_frete_medio
FROM order_items oi
WHERE oi.price <= 1100
GROUP BY oi.seller_id


"""
table=pd.read_sql_query(query,conn)
table

,seller_id,pedidos_unicos,data_min,data_max,valor_frete_min,valor_frete_max,valor_frete_medio
0,0015a82c2db000af6aaaf3ae2ecb0532,3,2017-10-12 22:24:16,2017-10-24 23:56:20,21.02,21.02,21.020000
1,001cca7ae9ae17fb1caed9dfb1094831,200,2017-02-08 19:06:04,2018-07-19 21:50:17,14.72,114.62,37.046611
2,001e6ad469a905060d959994f1b41e4f,1,2018-08-13 23:05:23,2018-08-13 23:05:23,17.94,17.94,17.940000
3,002100f778ceb8431b7a1020ff7ab48f,51,2017-09-20 01:10:15,2018-04-18 13:11:45,4.91,34.15,14.430182
4,003554e2dce176b5555353e4f3555ac8,1,2017-12-21 07:11:03,2017-12-21 07:11:03,19.38,19.38,19.380000
...,...,...,...,...,...,...,...
3051,ffcfefa19b08742c5d315f2791395ee5,1,2018-06-28 17:55:45,2018-06-28 17:55:45,9.62,9.62,9.620000
3052,ffdd9f82b9a447f6f8d4b91554cc7dd3,18,2017-03-09 16:30:20,2018-08-29 12:10:52,12.19,98.87,36.373000
3053,ffeee66ac5d5a62fe688b9d26f83f534,14,2017-10-05 16:14:11,2018-05-22 03:30:31,20.88,77.98,29.977857
3054,fffd5413c0700ac820c7069d66d98c89,60,2017-07-30 21:25:19,2018-08-28 20:10:15,9.94,206.45,46.454754
3055,ffff564a4f9085cd26170f4732393726,20,2016-10-17 19:01:41,2017-04-19 02:45:41,10.96,37.19,17.228000

# Exercicios PA Bond - aula 6

## Qual o número de clientes únicos nos estado de Minas Gerais ou Rio de Janeiro?

In [39]:
query="""
SELECT
customer_state,
COUNT( DISTINCT customer_id )
FROM customer c
WHERE c.customer_state = 'MG' OR c.customer_state = 'RJ'
GROUP BY customer_state
"""
table=pd.read_sql_query(query,conn)
table

  customer_state  COUNT( DISTINCT customer_id )
0             MG                          11635
1             RJ                          12852

##  Qual a quantidade de cidades únicas dos vendedores no estado de São Paulo ou Rio de Janeiro com a latitude maior que -24.54 e longitude menor que -45.63?

In [40]:
query="""

SELECT
g.geolocation_state,
COUNT( DISTINCT g.geolocation_city ) AS cidades
FROM geolocation g
WHERE g.geolocation_state = 'SP' OR g.geolocation_state = 'RJ'
AND ( g.geolocation_lat > -24.54 AND g.geolocation_lng < -45.63 )
GROUP BY g.geolocation_state

"""
table=pd.read_sql_query(query,conn)
table

  geolocation_state  cidades
0                RJ        9
1                SP     1048

## Qual o número total de pedidos únicos, o número total de produtos e o preço médio dos pedidos com o preço de frete maior que R$ 20 e a data limite de envio entre os dias 1 e 31 de Outubro de 2016?

In [44]:
## nao entendi price entre 10 e 100

query="""

SELECT
COUNT( DISTINCT oi.order_id ) AS pedidos,
COUNT( oi.product_id ) AS produtos,
AVG( oi.price ) AS preco_medio
FROM order_items oi
WHERE freight_value > 20
AND oi.price > 10 AND oi.price < 100 
AND oi.shipping_limit_date >= '2016-10-01'
AND oi.shipping_limit_date <= '2016-10-31'

"""
table=pd.read_sql_query(query,conn)
table

   pedidos  produtos  preco_medio
0       43       162     55.90537

## Mostre a quantidade total dos pedidos e o valor total do pagamento, para pagamentos entre 1 e 5 prestações ou um valor de pagamento acima de R$ 5000.

In [46]:
query="""

SELECT
    payment_type,
    payment_installments,
    COUNT( op.order_id ) AS pedidos,
    SUM( op.payment_value ) AS valor_total_pagamento
FROM order_payments op
WHERE ( op.payment_installments >= 1 AND op.payment_installments < 5 )
OR op.payment_value >= 5000
GROUP BY payment_type, payment_installments

"""
table=pd.read_sql_query(query,conn)
table

  payment_type  payment_installments  pedidos  valor_total_pagamento
0       boleto                     1    79136           1.147745e+07
1  credit_card                     1   101820           9.761782e+06
2  credit_card                     2    49652           6.317132e+06
3  credit_card                     3    41844           5.964415e+06
4  credit_card                     4    28392           4.655630e+06
5  credit_card                     8        4           2.771724e+04
6   debit_card                     1     6116           8.719592e+05
7  not_defined                     1       12           0.000000e+00
8      voucher                     1    23100           1.517747e+06

##  Qual a quantidade de pedidos com o status em processamento ou cancelada acontecem com a data estimada de entrega maior que 01 de Janeiro de 2017 ou menor que 23 de Novembro de 2016?

In [47]:
query="""

SELECT
    order_status ,
    COUNT( order_id ) AS pedidos
FROM orders o
WHERE ( order_status = 'processing' OR order_status = 'canceled' )
AND ( o.order_estimated_delivery_date > '2017-01-01' OR o.order_estimated_delivery_date < '2016-11-23' )
GROUP BY order_status


"""
table=pd.read_sql_query(query,conn)
table

  order_status  pedidos
0     canceled      611
1   processing      299

##  Quantos produtos estão cadastrados nas categorias: perfumaria, brinquedos, esporte lazer, cama mesa e banho e móveis de escritório que possuem mais de 5 fotos, um peso maior que 5 g, um altura maior que 10 cm, uma largura maior que 20 cm?

In [5]:
query="""

SELECT
    product_category_name ,
    COUNT( DISTINCT product_id )
FROM products p
WHERE ( product_category_name = 'perfumaria'
OR product_category_name = 'brinquedos'
OR product_category_name = 'esporte_lazer'
OR product_category_name = 'cama_mesa_banho'
OR product_category_name = 'moveis_escritorio')
AND product_photos_qty > 5
AND product_weight_g > 5
AND product_height_cm > 10
AND product_width_cm > 20
GROUP BY product_category_name


"""
table=pd.read_sql_query(query,conn)
table

  product_category_name  COUNT( DISTINCT product_id )
0            brinquedos                            30
1       cama_mesa_banho                            22
2         esporte_lazer                            69
3     moveis_escritorio                             7
4            perfumaria                             6

# Exercicios PA Bond - aula 7

## . Quantos clientes únicos tiveram seu pedidos com status de “processing”,“shipped” e “delivered”, feitos entre os dias 01 e 31 de Outubro de 2016. Mostrar o resultado somente se o número total de clientes for acima de 5.

In [8]:
query="""

SELECT
order_status,
COUNT( DISTINCT customer_id ) AS clientes_unicos
FROM orders o
WHERE order_purchase_timestamp BETWEEN '2016-10-01' AND '2016-10-31'
AND order_status IN ( 'processing', 'shipped', 'delivered' )
GROUP BY order_status
HAVING COUNT( DISTINCT customer_id ) > 5

"""
table=pd.read_sql_query(query,conn)
table

  order_status  clientes_unicos
0    delivered              265
1      shipped                8

## Mostre a quantidade total dos pedidos e o valor total do pagamento, para pagamentos entre 1 e 5 prestações ou um valor de pagamento acima de R$ 5000.

In [28]:
query="""

SELECT
    payment_type,
    payment_installments,
    COUNT( order_id ) AS pedidos,
    SUM(payment_value)
FROM order_payments op
WHERE payment_installments IN( 1,2,3,4,5) AND op.payment_value BETWEEN 0 AND 5000

GROUP BY payment_type, payment_installments
HAVING COUNT( payment_value ) > 5000

"""
table=pd.read_sql_query(query,conn)
table

  payment_type  payment_installments  pedidos  SUM(payment_value)
0       boleto                     1    79120        1.136942e+07
1  credit_card                     1   101816        9.707125e+06
2  credit_card                     2    49652        6.317132e+06
3  credit_card                     3    41844        5.964415e+06
4  credit_card                     4    28392        4.655630e+06
5  credit_card                     5    20956        3.844697e+06
6   debit_card                     1     6116        8.719592e+05
7      voucher                     1    23100        1.517747e+06

In [30]:
query="""

SELECT
    payment_type,
    payment_installments,
    COUNT( op.order_id ) AS pedidos,
    SUM( op.payment_value ) AS valor_total_pagamento
FROM order_payments op
WHERE op.payment_installments BETWEEN 1 AND 5
AND op.payment_value BETWEEN 0 AND 5000
GROUP BY payment_type, payment_installments
HAVING COUNT( op.order_id ) > 15000

"""
table=pd.read_sql_query(query,conn)
table

  payment_type  payment_installments  pedidos  valor_total_pagamento
0       boleto                     1    79120           1.136942e+07
1  credit_card                     1   101816           9.707125e+06
2  credit_card                     2    49652           6.317132e+06
3  credit_card                     3    41844           5.964415e+06
4  credit_card                     4    28392           4.655630e+06
5  credit_card                     5    20956           3.844697e+06
6      voucher                     1    23100           1.517747e+06

##  Quantos produtos estão cadastrados nas categorias: perfumaria, brinquedos, esporte lazer e cama mesa, que possuem entre 5 e 10 fotos, um peso que não está entre 1 e 5 g, um altura maior que 10 cm, uma largura maior que 20 cm. Mostra somente as linhas com mais de 10 produtos únicos.

##  Refazer a consulta SQL abaixo, usando os operadores de intervalo.

## Qual a quantidade de cidades únicas dos vendedores no estado de São Paulo ou Rio de Janeiro com a latitude maior que -24.54 e longitude menor que -45.63?

##  Quantos produtos estão cadastrados em qualquer categorias que comece com a letra “a” e termine com a letra “o” e que possuem mais de 5 fotos? Mostrar as linhas com mais de 10 produtos.

## Qual o número de clientes únicos, agrupados por estado e por cidades que comecem com a letra “m”, tem a letra “o” e terminem com a letra “a”? Mostrar os resultados somente para o número de clientes únicos maior que 10.